In [29]:
import pandas as pd

In [112]:
df_json = pd.read_json('parte1.json')

In [31]:
from unicodedata import decimal
df_json = df_json.round({'prop': 11})

In [32]:
df_json.to_csv("parte1.csv",index=False)

In [33]:
parte1 = pd.read_csv('parte1.csv', sep=',')

In [34]:
parte1.head()

   year sex      name     n    prop
0  1880   F      Mary  7065  0.0724
1  1880   F     Sarah  1288  0.0132
2  1880   F     Clara  1226  0.0126
3  1880   F      Ella  1156  0.0118
4  1880   F  Florence  1063  0.0109

In [121]:
parte2 = pd.read_csv('parte2.csv', sep=',')

In [122]:
parte2.head(10)

   year sex    name     n      prop
0  1880   F  Minnie  1746  0.017888
1  1880   F     Ida  1472  0.015081
2  1880   F   Alice  1414  0.014487
3  1880   F   Annie  1258  0.012889
4  1880   F  Martha  1040  0.010655
5  1880   F  Nellie   995  0.010194
6  1880   F  Carrie   949  0.009723
7  1880   F   Maude   858  0.008791
8  1880   F  Bessie   796  0.008155
9  1880   F  Jennie   793  0.008125

In [44]:
parte1.head()

   year sex      name     n    prop
0  1880   F      Mary  7065  0.0724
1  1880   F     Sarah  1288  0.0132
2  1880   F     Clara  1226  0.0126
3  1880   F      Ella  1156  0.0118
4  1880   F  Florence  1063  0.0109

In [123]:
dataframe = pd.concat([parte1, parte2], axis=0)

In [124]:
dataframe

        year sex      name     n      prop
0       1880   F      Mary  7065  0.072400
1       1880   F     Sarah  1288  0.013200
2       1880   F     Clara  1226  0.012600
3       1880   F      Ella  1156  0.011800
4       1880   F  Florence  1063  0.010900
...      ...  ..       ...   ...       ...
641550  2017   M    Ziyang     5  0.000003
641551  2017   M    Zohaan     5  0.000003
641552  2017   M     Zoren     5  0.000003
641553  2017   M    Zorion     5  0.000003
641554  2017   M    Zyhier     5  0.000003

[1283110 rows x 5 columns]

In [110]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('parte3.sqlite')

df = pd.read_sql_query("SELECT * FROM parte3 WHERE tipo_dado = 1", cnx)

In [111]:
df.describe()

                year              n           prop  tipo_dado
count  641555.000000  641555.000000  641555.000000   641555.0
mean     1974.814926     180.255328       0.000136        1.0
std        34.027568    1498.825045       0.001149        0.0
min      1880.000000       5.000000       0.000002        1.0
25%      1951.000000       7.000000       0.000004        1.0
50%      1985.000000      12.000000       0.000007        1.0
75%      2003.000000      32.000000       0.000023        1.0
max      2017.000000   92695.000000       0.081546        1.0

In [113]:
df = df[['year','sex','name','n','prop']]

In [114]:
df.describe()

                year              n           prop
count  641555.000000  641555.000000  641555.000000
mean     1974.814926     180.255328       0.000136
std        34.027568    1498.825045       0.001149
min      1880.000000       5.000000       0.000002
25%      1951.000000       7.000000       0.000004
50%      1985.000000      12.000000       0.000007
75%      2003.000000      32.000000       0.000023
max      2017.000000   92695.000000       0.081546

In [125]:
dataframe = pd.concat([dataframe, df], axis=0)

In [99]:
dataframe

        year sex      name     n    prop
0       1880   F      Mary  7065  0.0724
1       1880   F     Sarah  1288  0.0132
2       1880   F     Clara  1226  0.0126
3       1880   F      Ella  1156  0.0118
4       1880   F  Florence  1063  0.0109
...      ...  ..       ...   ...     ...
641550  2017   M     Zevon     5  0.0000
641551  2017   M    Zikora     5  0.0000
641552  2017   M    Zubeyr     5  0.0000
641553  2017   M    Zyheem     5  0.0000
641554  2017   M     Zykai     5  0.0000

[2566220 rows x 5 columns]

In [126]:
dataframe.to_csv('data.csv', index=False, sep='^')

In [127]:
data = pd.read_csv('data.csv', sep="^")

In [128]:
data

         year sex      name     n      prop
0        1880   F      Mary  7065  0.072400
1        1880   F     Sarah  1288  0.013200
2        1880   F     Clara  1226  0.012600
3        1880   F      Ella  1156  0.011800
4        1880   F  Florence  1063  0.010900
...       ...  ..       ...   ...       ...
1924660  2017   M     Zevon     5  0.000003
1924661  2017   M    Zikora     5  0.000003
1924662  2017   M    Zubeyr     5  0.000003
1924663  2017   M    Zyheem     5  0.000003
1924664  2017   M     Zykai     5  0.000003

[1924665 rows x 5 columns]

In [161]:
nomes = data[data.year <= 2000]

SyntaxError: invalid syntax (4236836308.py, line 1)

In [159]:
nomes['year'].describe()

count    1.362509e+06
mean     1.960724e+03
std      3.070731e+01
min      1.880000e+03
25%      1.937000e+03
50%      1.968000e+03
75%      1.987000e+03
max      2.000000e+03
Name: year, dtype: float64

In [160]:
nomes['year'].nunique()

121